<a href="https://colab.research.google.com/github/nikhilbordekar/SQL-Practice/blob/main/SQL_file.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Nikhil Bordekar's Notes**

## SQL CREATE TABLE STATEMENT:

The SQL CREATE TABLE statement is used to define and create a new table in a relational database. This statement specifies the table's name and the structure of its columns. The general syntax for creating a table is as follows:

```sql
CREATE TABLE table_name (
    column1 datatype,
    column2 datatype,
    ...
    columnN datatype
);
```

Example:

Let's create a simple table named "Employees" with columns for employee information:

```sql
CREATE TABLE Employees (
    EmployeeID INT,
    FirstName VARCHAR(50),
    LastName VARCHAR(50),
    Email VARCHAR(100),
    HireDate DATE
);
```


## SQL INSERT INTO STATEMENT:

The SQL INSERT INTO statement is used to insert new records or rows into an existing table in a relational database. You specify the table where the data should be inserted and provide the values or data for each column in the table. The general syntax for the INSERT INTO statement is as follows:

```sql
INSERT INTO table_name (column1, column2, column3, ...)
VALUES (value1, value2, value3, ...);
```
Now, let's insert a new employee into the "Employees" table:
```sql
INSERT INTO Employees (EmployeeID, FirstName, LastName, Email, HireDate)
VALUES (3, 'Alice', 'Williams', 'alice.w@email.com', '2023-03-10');
```

## ALTER TABLE STATEMENT (TO CHANGE COLUMN NAME)

To change the name of a column in an SQL table, you can use the ALTER TABLE statement with the RENAME COLUMN clause. The specific syntax can vary slightly depending on the database management system (DBMS) you are using. Below, I'll provide a general example using standard SQL syntax:

```sql
ALTER TABLE table_name
CHANGE COLUMN old_column_name new_column_name data_type;
```
Example:

Suppose you have a table named "Employees" with a column named "EmployeeLastName," and you want to change it to "EmployeeSurname." You can use the following SQL statement:

```sql
ALTER TABLE Employees
CHANGE COLUMN EmployeeLastName EmployeeSurname VARCHAR(50);

```

##`SELECT` & `WHERE`

In SQL, the SELECT and WHERE clauses are fundamental components used for filtering and selecting data from a database
```sql
SELECT first_name, last_name
FROM employees
WHERE department = 'HR' AND salary > 50000;
```
In this example, the SELECT clause specifies the columns (first_name and last_name) to be included in the result set. The WHERE clause filters the rows, ensuring that only employees in the 'HR' department with a salary greater than 50,000 are selected.

These clauses are essential for retrieving specific data from a database, enabling you to tailor your query results to your precise requirements.

## UPDATE STATEMENET (TO UPDATE VALUE IN THE COLUMN)


To change the values in a column of an SQL table, you can use the UPDATE statement. The UPDATE statement allows you to modify existing data in a table based on a specified condition. Here's the basic syntax for updating values in a column:

```sql
UPDATE table_name
SET column_name = new_value
WHERE condition;
```
Example:

Suppose you have a table named "Students" with a column "Grade," and you want to update the grade of a specific student with ID 123 to 'A'. You can use the following SQL statement:

```sql
UPDATE Students
SET Grade = 'A'
WHERE StudentID = 123;
```

## DELETE, TRUNCATE & DROP

## 1.DELETE:

Definition: The DELETE statement is **used to remove specific rows** from a table based on a specified condition. It's a data manipulation language (DML) command.

Syntax:
```sql
DELETE FROM table_name
WHERE condition;
```
Example: Suppose you have a table named "Employees," and you want to delete the employee with an ID of 101.
```sql
DELETE FROM Employees
WHERE EmployeeID = 101;
```

## 2.TRUNCATE

Definition: The TRUNCATE statement is **used to remove all the rows from a table** while keeping the table structure intact. It's also a DDL command.

Syntax:
```sql
TRUNCATE TABLE table_name;
```
Example: To remove all rows from the "Students" table while keeping the table structure, you can use:
```sql
TRUNCATE TABLE Students;
```

## 3.DROP

Definition: The DROP statement is **used to delete an entire table or database** object, including all the data, indexes, and constraints. It's a data definition language (DDL) command.

Syntax:

1. To drop a table:

```sql
DROP TABLE table_name;
```
  EXAMPLE:
```sql
DROP TABLE Employees;
```
2. To drop a database:

```sql
DROP DATABASE database_name;
```
  EXAMPLE:
```sql
DROP DATABASE KPMG;
```

## `AGGREGATE FUNCTIONS`

Here are examples of how to use `COUNT`, `SUM`, `MAX`, `GROUP BY`, and `HAVING` to aggregate data using SQL code:

Let's say we have a table named `orders` with the following columns: `order_id`, `customer_id`, `order_date`, and `total_amount`.

1. **COUNT**: To count the number of orders for each customer:

```sql
SELECT customer_id, COUNT(order_id) AS order_count
FROM orders
GROUP BY customer_id;
```

2. **SUM**: To calculate the total amount spent by each customer:

```sql
SELECT customer_id, SUM(total_amount) AS total_spent
FROM orders
GROUP BY customer_id;
```

3. **MAX**: To find the highest order amount for each customer:

```sql
SELECT customer_id, MAX(total_amount) AS max_order_amount
FROM orders
GROUP BY customer_id;
```

4. **GROUP BY**: To group the results by a specific column (e.g., `order_date`) and then aggregate:

```sql
SELECT order_date, COUNT(order_id) AS order_count, SUM(total_amount) AS total_spent
FROM orders
GROUP BY order_date;
```

5. **HAVING**: To filter the results of a grouped query based on an aggregate condition (e.g., customers who have spent more than $1,000):

```sql
SELECT customer_id, SUM(total_amount) AS total_spent
FROM orders
GROUP BY customer_id
HAVING SUM(total_amount) > 1000;
```

In this example, the `HAVING` clause filters the results to include only those customers whose total spending (`SUM(total_amount)`) is greater than $1,000.

These SQL queries demonstrate how to use aggregate functions (`COUNT`, `SUM`, `MAX`) along with `GROUP BY` and `HAVING` to analyze and summarize data in a database.

## `DISTINCT`

Let's assume we have a table named `employees` with the following columns: `employee_id`, `first_name`, `last_name`, and `department`.

1. **DISTINCT**: To retrieve a distinct list of departments:

```sql
SELECT DISTINCT department
FROM employees;
```

This query will return a list of unique department names from the `employees` table.

2. **COUNT DISTINCT**: To count the number of distinct departments:

```sql
SELECT COUNT(DISTINCT department) AS distinct_department_count
FROM employees;
```

This query will return the count of unique department names in the `employees` table.

3. **DISTINCT with Multiple Columns**: To get distinct combinations of `first_name` and `last_name`:

```sql
SELECT DISTINCT first_name, last_name
FROM employees;
```

This query will return a list of unique combinations of first names and last names from the `employees` table.

4. **COUNT DISTINCT with Multiple Columns**: To count the number of distinct employee combinations (first name and last name):

```sql
SELECT COUNT(DISTINCT first_name, last_name) AS distinct_employee_count
FROM employees;
```

This query will return the count of unique combinations of first names and last names in the `employees` table.

These SQL queries illustrate how to use `DISTINCT` to retrieve unique values or combinations and `COUNT DISTINCT` to count the number of unique values or combinations in a table. These operations are valuable for data analysis and reporting when you want to work with distinct elements within your dataset.

## LIKE & ILIKE
**1. LIKE:**

The LIKE operator is case-sensitive, meaning it distinguishes between uppercase and lowercase characters.
It's used to match text values based on patterns using wildcard characters:
%: Matches any sequence of characters (including no characters).
_: Matches any single character.
For example, column_name LIKE 'abc%' would match values starting with 'abc', such as 'abc123' or 'abcxyz'.

**2. ILIKE:**

The ILIKE operator is case-insensitive, meaning it does not distinguish between uppercase and lowercase characters.
It's used to perform a case-insensitive pattern match.
It also uses wildcard characters % and _, just like LIKE.
For example, column_name ILIKE 'abc%' would match values starting with 'abc' regardless of case, such as 'abc123', 'ABCXYZ', or 'aBc456'.

**Examples:**

Suppose you have a table called "Products" with a "Product_Name" column, and you want to retrieve products that have names starting with "apple" (case-insensitive):

```sql
-- Using ILIKE (case-insensitive)
SELECT * FROM Products
WHERE Product_Name ILIKE 'apple%';

-- Using LIKE (case-sensitive)
SELECT * FROM Products
WHERE Product_Name LIKE 'apple%';
```